package StudentTable;

import java.util.Scanner;

public class task_1 {
    //Задача: вывести красивую таблицу учеников - номер студента, имя + высчитывание возраста
    public static void main(String[] args) {
        System.out.format("-%18s %8s %8s", "Team", "Wins", "Losses");
        System.out.println();
        System.out.format("%-18s %8s %8s", "Пингвины", "3", "4");
        System.out.println();
        System.out.format("%-18s %8s %8s", "Зеленые чебурашки", "1", "7");







    }
}
